[
    {
        "element": "h1",
        "content": "Cambio de mentalidad"
    },
    {
        "element": "h2",
        "content": "Intro"
    },
    {
        "element": "p",
        "content": "Si bien habia trabajado en varios lados (el que mas me gustaba era ser referi) pero ninguno terminaba de llenarme. Mandé dos o tres curriculum a empresas de desarrollo y no tuve suerte, solo 1 entrevista que no siguió a mas. Si bien me encantaba programar, no me esforzaba en hacer un buen curriculum, ni portfolio (recien ahora lo estoy haciendo 😄), ni preparar las entrevistas ni tampoco buscar a que empresa estaba mandando solicitud. Obviamente estaba haciendo las cosas mal pero para el yo de ese entonces no era tan obvio, tampoco tenia amigos en el rubro como para que me guiaran (sientanse libres de contactarme o tambien pueden buscar grupos en discord si necesitan conversar o sacarse dudas ( ojo igual si entran a grupos que nunca falta el que tira hate)). "
    },
    {
        "element": "h2",
        "content": "Viaje iluminador"
    },
    {
        "element": "p",
        "content": "Con un amigo decidimos hacer un viaje a la playa y justo vimos una propaganda de un bootcamp de surf (pagabas una plata y ellos te llevaban, te daban comida, casa y si querias te enseñaban a surfear). Al principio dudé si ir o no porque soy medio antisocial (antisocial no es la palabra pero prefiero esta solo en casa), pero al final le terminé diciendo que si. Por cosas del destino eramos 8 adultos y todos los demas eran adolescentes haciendo un viaje (parecia excursion liceal) entonces los adultos fuimos en un omnibus totalmente viejo pero medio adaptado como para vivir en el. Fuimos acompañados por 2 o 3 organizadores que hicieron del viaje una experiencia. <br> Ibamos mucho mas lento que los adolescentes en su omnibus nuevo y en cierto momento tuvimos que parar por un problema en el motor. En otra ocasion eso me hubiera puesto de malas pero fue tan lindo el ambiente que todos nos bajamos a ver si podiamos dar una mano pero no pudimos porque no entendemos nada de mecanica 😄, entonces los animadores bajaron sus patinetas y se pusieron a patinar, otros se juntaron a jugar cartas (actividad que veniamos haciendo arriba del omnibus) y la situacion que parecia mala en principio resultó divertida.<br> Ahora escribiendo esto se me hizo como gracioso que los viejos ibamos en el omnibus viejo que ademas no andaba muy bien y tenia que ir lento, mientras que los jovenes en el rapido y que andaba bien. Les puedo asegurar lo que quieran que no se divirtieron tanto ni disfrutaron el viaje como nosotros. Como a veces no nos damos cuenta de mas jovenes pero no es tan importante ir rapido, sino disfrutar del viaje como dice una frase de Brandon Sanderson <i>'Journey before destination'</i>. <br> Bueno para ir cerrando, de los otros adultos que viajaban con nosotros, 2 eran ingenieros, 1 programador y otra trabajaba en recursos humanos. Eran realmente mis primeros vinculos con gente mas o menos del medio al que yo queria pertenecer entonces aproveché la ocasion y pregunté de todo. Por suerte todos muy buena onda me respondieron, me dieron tips, me ayudaron con la creacion del curriculum y a distribuirlo con sus contactos."
    },
    {
        "element": "h2",
        "content": "Un nuevo yo"
    },
    {
        "element": "p",
        "content": "Al volver del viaje tenia todo mas claro, mi actitud tenia que cambiar. Me habian hablado muy bien de las habilidades blandas y todas estas cosas que sumado con los conocimientos tecnicos son lo que a las empresas le interesa conocer de uno. Asi que sin mas que esperar decidí anotarme a Jovenes a programar, un curso de pocos meses en el que enseñan lo basico de programacion web, ingles y habilidades blandas. Obviamente la parte tecnica era algo muy por debajo del nivel que yo ya tenia (aunque 2 o 3 cosas si aprendí), pero la parte de habiidades y autoconocimientos me ayudó un monton. Siempre habia sido de los que creen que solo importa lo tecnico pero que errado que estaba. <br> Basicamente cuando estaba terminando Jovenes a programar mandé otra vez curriculums aunque tampoco tuve suerte. Busqué en internet tips/videos lo que sea para ver en que fallaba y me encontré con muchos videos del estilo 'Con este curriculum entré a goolge', pero claro, despues les veias la experiencia y habian trabajado en Apple y Microsoft antes. <br> Un dia me llega un mensaje a linkedin de un recruiter que le habia gustado mi perfil, yo no lo podia creer. De no tener una entrevista mandando curriculums a que de la nada alguien se interesara."
    },
    {
        "element": "h2",
        "content": "Poniendo todos los conocimientos en practica"
    },
    {
        "element": "p",
        "content": "Sabia que esta oportunidad no la podia desaprovechar asi que fui a google y busqué como contestar este tipo de mensajes en linkedin 🤣. Agarré un template, le introduje mis datos y lo mandé. El recruiter me pregunta 'para que posicion queres? QA o DEV?', imaginense mi emoción, no solo a alguien le habia gustado mi perfil, sino que me daban a elegir el area. Yo como buena persona que quiere entrar a este mundo le dije 'me gustaria de dev pero si me dejan hago las dos pruebas, y en el que mas les sirva me dicen y yo acepto'. Asi fue, hice las dos pruebas y me dejaron elegir (elegí fontend developer). <br> Igual todavia no podia festejar, aun faltaba la parte complicada <b>LAS ENTREVISTAS PERSONALES</b>. Tambien faltaba la prueba de ingles pero fue en una pagina que te graba entonces pude hacerla tranquilo, sin sentir que me estaban juzgando ni mirando. <br> La entrevista (por primera vez) la preparé, busqué info de la empresa, me hice un bloc de notas con los temas que queria comentar sobre mi, una breve descripcion y la respuesta a las tipicas preguntas tipo <i>Decime tres cosas buenas tuyas y tres malas</i>... Que decirles, entre lo estudiado que fui a la entrevista y que la entrevistador la hizo muy amena, quedé encantado. Nunca habia hablado de mi lado gamer en una entrevista de trabajo, nunca me habia pasado de no trancarme, de que no hubieran momentos de silencio."
    },
    {
        "element": "h2",
        "content": "Noticia final"
    },
    {
        "element": "p",
        "content": "Si bien todo el proceso mejorando con cada paso, fue un proceso largo. Por mas que yo estaba feliz una parte de mi dudaba si iba a quedar o no porque demoraba mucho tiempo despues de cada entrevista en darme noticias. Yo cada tantos dias mandaba un mail tipo 'hola, soy gustavo, no se olviden de mi porfavor 🙏' a lo que me respondian explicando que al ser una empresa extranjera todo iba hacia afuera del pais y la desicion tenia que venir de alla. <br> Un dia como cualquier otro, aburrido estaba yo en el deposito de la rotiseria, me llega un email dandome las felicitaciones por haber quedado en el puesto y se me informaba mi sueldo y mi fecha de comienzo. Creo que es de los dias mas felices de mi vida."
    },
    {
        "element": "h2",
        "content": "Conclusiones y consejos"
    },
    {
        "element": "list",
        "items":["Si no hubiera ido a ese viaje capaz que nunca hubiese cambiado el chip. Creo que a veces hay que esperar (haciendo cosas) que la vida nos sorprenda.", "Hacer contactos/amistades con gente que busque lo mismo que vos o ya lo halla encontrado. Me sirvieron muchos los consejos que me dieron y que mandaran mi curriculum entre sus contactos (no se si el recruiter se fijó en mi gracias a esto pero igual debe de haber ayudado)", "Si tienen chance de hacer un cursito que tenga Habilidades blandas, haganlo. No van a perder nada y algo van a llevarse.", "Tener prefil en linkedin (si pueden un poco activo, yo no lo tengo activo pero ayuda), el curriculum bien hecho y actualizado, portfolio les diria que tambien aunque yo no lo uso, tomarse el tiempo al mandar el cv (si pueden escribir un mensaje al reclutador mejor) y preparen las entrevistas."]
    },
    {
        "element": "p",
        "content": "Ademas, haciendo referencia a la historia en el omnibus, creo que nunca esta mejor usada la frase de Journey before destination (disfrutar el camino basicamente) porque en este camino que arrancó medio mal, hice amistades, gané conocimientos y conseguí trabajo."
    }
]